Revit 2015 API
AnalyticalModel.IsValidProjectionDatumPlane Method
 Indicates if a given Datum Plane is valid for analytical model projection with respect to the given analytical direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2011
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2015. It was used as validator to AnalyticalModel.SetAnalyticalProjectionDatumPlane() method that was deprecated and replaced by AnalyticalModelStick.SetProjection() methods and AnalyticalModelColumn.BaseExtensionPlaneId, AnalyticalModelColumn.TopExtensionPlaneId, AnalyticalModelSurface.ProjectionPlaneZ, AnalyticalModelSurface.BottomExtensionPlaneId, AnalyticalModelSurface.TopExtensionPlaneId properties.")]
public bool IsValidProjectionDatumPlane(
	AnalyticalElementSelector selector,
	AnalyticalDirection direction,
	ElementId datumPlaneId
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2015. It was used as validator to AnalyticalModel.SetAnalyticalProjectionDatumPlane() method that was deprecated and replaced by AnalyticalModelStick.SetProjection() methods and AnalyticalModelColumn.BaseExtensionPlaneId, AnalyticalModelColumn.TopExtensionPlaneId, AnalyticalModelSurface.ProjectionPlaneZ, AnalyticalModelSurface.BottomExtensionPlaneId, AnalyticalModelSurface.TopExtensionPlaneId properties.")> _
Public Function IsValidProjectionDatumPlane ( _
	selector As AnalyticalElementSelector, _
	direction As AnalyticalDirection, _
	datumPlaneId As ElementId _
) As Boolean
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2015. It was used as validator to AnalyticalModel.SetAnalyticalProjectionDatumPlane() method that was deprecated and replaced by AnalyticalModelStick.SetProjection() methods and AnalyticalModelColumn.BaseExtensionPlaneId, AnalyticalModelColumn.TopExtensionPlaneId, AnalyticalModelSurface.ProjectionPlaneZ, AnalyticalModelSurface.BottomExtensionPlaneId, AnalyticalModelSurface.TopExtensionPlaneId properties.")]
public:
bool IsValidProjectionDatumPlane(
	AnalyticalElementSelector selector,
	AnalyticalDirection direction,
	ElementId^ datumPlaneId
)
Parameters
selector
Type: Autodesk.Revit.DB.Structure.AnalyticalElementSelector
 End of the analytical model.
direction
Type: Autodesk.Revit.DB.Structure.AnalyticalDirection
 Direction of analytical model projection.
datumPlaneId
Type: Autodesk.Revit.DB.ElementId
 Datum Plane on to which analytical model is projected.
Return Value
 True if Datum Plane is valid, false otherwise.
Remarks
 Validity of a Datum Plane for analytical projection is both element and context specific. For instance, two different Beams may have two different results.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace